[
  {
    "id": "lp136nupAc3ToAvu",
    "type": "work",
    "title": "Software Engineer",
    "subtitle": "Software Engineer at Acuratio",
    "resume": "Responsible for backend and frontend development as well as database management. I work on building and maintaining a platform that allows companies to merge data sets while maintaining data protection.",
    "description": "Contribute to the comprehensive development of the company's federated learning platform. My responsibilities include designing and implementing both frontend and backend components, ensuring seamless integration between the two. Additionally, I manage database interactions, collaborating closely with the team to deliver solutions that enable organizations to combine and analyze data collaboratively, all while upholding the highest standards of data privacy and security.",
    "date": "Feb. 2024 ➡ Present"
  },
  {
    "id": "v6adHHwHjIUvCgpB",
    "type": "work",
    "title": "Cloud Architecture Analyst",
    "subtitle": "Cloud Transformation & Architecture Analyst at Accenture",
    "resume": "Implement cloud-based solutions, utilizing ServiceNow to optimize workflows and operations. I contributed to the successful transformation of cloud architectures and improved service delivery for clients..",
    "description": "Played an important role in helping clients with their cloud transformation. I analyzed their needs and implemented cloud-based solutions, optimizing operations and improving service delivery. Using ServiceNow, I automated workflows, increased system efficiency, and ensured seamless integration with other platforms. In addition, I earned two certifications, Flow Designer and the Certified System Administrator, which deepened my knowledge of ServiceNow and its capabilities. This enabled me to contribute more effectively to optimizing cloud architectures and ensure that our solutions are scalable and tailored to customer needs.",
    "date": "Feb. 2022 ➡ Oct. 2023"
  },
  {
    "id": "tbP1XaLq1QoD2EQe",
    "type": "work",
    "title": "Mobile Developer",
    "subtitle": "Mobile Developer at Recomiend.app",
    "resume": "Building and maintaining cross-platform mobile applications, ensuring seamless functionality on both iOS and Android. I worked closely with product and design teams to implement user-friendly features while optimizing performance and ensuring high-quality code standards.",
    "description": "Focused mainly on extending and maintaining a mobile app that ran on both iOS and Android. I worked with cross-functional teams to design user-friendly experiences and develop new features. My role also involved optimizing app performance, ensuring smooth functionality across both platforms, and addressing any issues that arose during development. I collaborated closely with product managers, designers, and QA engineers to deliver high-quality updates and features, while adhering to best practices for code quality, testing, and debugging. This helped improve the overall user experience and contributed to the app’s ongoing success.",
    "date": "Mar. 2021 ➡ Jan. 2022"
  },
  {
    "id": "lddTaWCYmO21C0qt",
    "type": "education",
    "title": "Bachelor in Computer Science",
    "subtitle": "Bachelor's degree in Computer Science with Mention in Computation",
    "resume": "A multidisciplinary program combining software engineering, algorithms, data structures, computational theory, and system architecture, emphasizing both theoretical and practical applications in computing.",
    "description": "The Bachelor's in Computer Science provided a solid foundation in key computer science areas, including software engineering, algorithms, data structures, and computation. The curriculum offered both theoretical insights into computational models and hands-on experience through projects, which helped develop technical and problem-solving skills. The program also emphasized teamwork, research, and the ability to adapt to rapid technological advancements, preparing me for roles in software development, systems analysis, and research.",
    "date": "Aug. 2016 ➡ May 2021"
  }
]